Revit 2024 API
ParameterTypeId.ProjectedSurfaceArea Property
 "Projected Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ProjectedSurfaceArea { get; }
Visual Basic
Public Shared ReadOnly Property ProjectedSurfaceArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ProjectedSurfaceArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace